//========================================
// 
// パーツ処理
// 
//========================================
// *** parts.cpp ***
//========================================
#include "parts.h"

//========================================
// コンストラクタ
//========================================
CParts::CParts()
{
	m_posOrigin = INIT_D3DXVECTOR3;		// 元の位置
	m_rotOrigin = INIT_D3DXVECTOR3;		// 元の向き
	m_posDest = INIT_D3DXVECTOR3;		// 目的の位置
	m_rotDest = INIT_D3DXVECTOR3;		// 目的の向き
}

//========================================
// デストラクタ
//========================================
CParts::~CParts()
{

}

//========================================
// 生成
//========================================
CParts * CParts::Create()
{
	// オブジェクトインスタンス
	CParts *pParts = NULL;

	// メモリの解放
	pParts = new CParts;

	// メモリの確保ができなかった
	assert(pParts != NULL);

	// 数値の初期化
	pParts->Init();

	// インスタンスを返す
	return pParts;
}